/*Калькулятор v.0.2

Усовершенствуйте программу, написанную на прошлом шаге. Теперь она должна работать для любых целых чисел, включая случай, когда b=0.

Входные данные:
Два целых числа a, b и символ действия c. Обратите внимание, что порядок входных данных изменился!

Выходные данные:
Одно вещественное число -- результат, либо строка ERROR!, если введено недопустимое действие или действие выполнить невозможно (деление на ноль).

Формат вывода чисел: два знака после запятой.



Напоминание:

Пробелы во входной строке тоже являются символами. Убедитесь, что Вы считываете в переменную именно символ действия, а не символ пробела.*/
#include <stdio.h>
int main(void)
{
    int a1, b1;
    char c;
    scanf("%d%d %c", &a1, &b1, &c);
    double a = a1;
    double b = b1;
    switch (c)
    {
    case '+':
        printf("%.2f\n", a + b);
        break;
    case '-':
        printf("%.2f\n", a - b);
        break;
    case '*':
        printf("%.2f\n", a * b);
        break;
    case '/':
        switch (b1)
        {
        case 0:
            printf("ERROR!");
            break;
        default:
            printf("%.2f\n", a / b);
            break;
        }
        break;
    default:
        printf("ERROR!");
        break;
    }
    return 0;
}