/*
Гадание на ромашке

Написать программу, определяющую результат гадания на ромашке по количеству лепестков на ней.

Отрывая первый лепесток (нечётное число), произносится фраза Любит, второй (чётное число) -- Не любит.

Входные данные:
Одно натуральное число kk -- количество лепестков на ромашке.

Выходные данные:
Одна строка в зависимости от результата: Любит или Не любит.
*/
#include <stdio.h>
#include <locale.h>
int main(void)
{
    setlocale(LC_ALL, "");
    int sum;
    scanf("%d", &sum);
    sum = sum % 2;
    switch (sum)
    {
    case 0:
        printf("Не любит\n");
        break;
    case 1:
        printf("Любит\n");
        break;
    default:
        break;
    }

    return 0;
}