/*
Калькулятор v.0.3

Давайте ещё раз усовершенствуем программу, написанную на прошлом шаге. 

    Добавьте поддержку новой операции ^ -- возведение в степень. Например, 2 ^ 3 будет 8.00. 
    Добавьте поддержку символа : для деления и символа x (икс) для умножения. Символы / и * также должны нормально работать.

Входные данные:
Два целых числа aa, bb между которыми записан символ действия cc.  Гарантируется, что aa и bb не равны нулю одновременно. Обратите внимание, что порядок входных данных снова изменился!

Выходные данные:
Одно вещественное число -- результат, либо строка ERROR!, если введено недопустимое действие или действие выполнить невозможно.

Формат вывода чисел: два знака после запятой.
*/
#include <stdio.h>
int main(void)
{
    int a1, b1;
    char c;
    scanf("%d%d %c", &a1, &b1, &c);
    double a = a1;
    double b = b1;
    switch (c)
    {
    case '+':
        printf("%.2f\n", a + b);
        break;
    case '-':
        printf("%.2f\n", a - b);
        break;
    case '*':
        printf("%.2f\n", a * b);
        break;
    case '/':
        switch (b1)
        {
        case 0:
            printf("ERROR!");
            break;
        default:
            printf("%.2f\n", a / b);
            break;
        }
        break;
    default:
        printf("ERROR!");
        break;
    }
    return 0;
}