/*
Правильные дроби

Написать программу, проверяющую является ли правильной дробь A/B​.

Входные данные:
Два натуральных числа A,B.

Выходные данные:
Строка yes, если дробь правильная, строка no в противном случае.

Справка:
Дробь называется правильной, если знаменатель больше числителя. Знаменатель -- число, находящееся под дробной чертой.
*/
#include <stdio.h>
int main(void)
{
    int a = 0;
    int b = 0;
    scanf("%d%d", &a, &b);
    if (a > b)
    {
        printf("no\n");
    }
    else
    {
        printf("yes\n");
    }

    return 0;
}