/*
Электронный кодовый замок

Кнопочный электронный кодовый замок имеет десять кнопок. Каждая из кнопок имеет свой порядковый номер от 00 до 99. Правильный код -- 1024 зашит внутрь замка. Человек, который хочет открыть дверь, должен ввести на циферблате последовательно 1, 0, 2 и 4.

Напишите программу, моделирующую работу такого замка.

Входные данные:
Четыре целых числа b1,b2,b3,b4​ -- номера кнопок, которые нажал человек.

Выходные данные:
Строка open, если введён правильный код. Строка closed, если введён неправильный код.
*/
#include <stdio.h>
int main(void)
{
    int b1 = 0, b2 = 0, b3 = 0, b4 = 0;
    scanf("%d%d%d%d", &b1, &b2, &b3, &b4);
    if ((b1 * 1000 + b2 * 100 + b3 * 10 + b4) == 1024)
    {
        printf("open\n");
    }
    else
    {
        printf("closed\n");
    }

    return 0;
}