/*
Больше-меньше

Напишите проверяющую систему для игры "Больше-меньше".

Входные данные:
Два целых числа:

    первое -- загаданное число;
    второе -- ответ игрока;

Выходные данные:

    Если игрок угадал число, то выведите строку You win!
    Если игрок не угадал число, то выведите:
        more если загаданное число больше ответа игрока;
        less если загаданное число меньше ответа игрока.

*/
#include <stdio.h>
int main(void)
{
    int zag = 0, otv = 0;
    scanf("%d%d", &zag, &otv);
    if (otv == zag)
    {
        printf("You win!\n");
    }
    if (otv < zag)
    {
        printf("more\n");
    }
    if (otv > zag)
    {
        printf("less");
    }

    return 0;
}