/*
Досрочный выход

На уроке мы с вами разобрали программу, которая определяет номер квадранта, в котором располагается точка с координатами (x,y).
Чтобы не разбираться со случаями, когда точка лежит на одной из осей координат мы условились, что x и y не могут быть равны нулю.

Используя подход early returns, описанный в уроке, добавьте в эту программу проверку данных, поступающих на вход программе.

Входные данные:
От нуля до двух вещественных чисел x, y.

Выходные данные:

    Если данных для работы недостаточно, то вывести строку Incorrect input
    Одно целое число -- номер квадранта, в котором расположена точка (x,y).
    Если точка располагается на одной из осей, либо в начале координат, то вывести строку Incorrect input

ВАЖНО!
В ранних возвратах используйте return 0; для завершения работы программы. Иначе проверяющая система Степика будет засчитывать ваш ответ как ошибочный. Т.е. вот так:

if (return_condition){
        // ...
        return 0; // тут обязательно 0
}
*/
#include <stdio.h>

int main(void)
{
    double x, y;
    scanf("%lf%lf", &x, &y);

    // Добавьте сюда early returns

    if (x > 0)
    {
        if (y > 0)
        {
            printf("%d\n", 1);
            return 0;
        }
        else
        {
            printf("%d\n", 4);
            return 0;
        }
      return 0;  
    }
    else
    {
        if (y > 0)
        {
            printf("%d\n", 2);
            return 0;
        }
        else
        {
            printf("%d\n", 3);
            return 0;
        }
        return 0;
    }

    
    return 0;
}