/*
Лифт

Написать программу, моделирующую работу лифта, находящегося на первом этаже.

Каждый заходящий в кабину лифта человек нажимает кнопку с номером этажа.
 После этого лифт определяет наиболее быстрый порядок транспортирования пассажиров, расставляя соответствующим образом этажи, на которых он должен остановиться.

Входные данные:
Три целых числа от 2 до 40 — номера этажей, на которые необходимо подняться пассажирам лифта.

Выходные данные:
Три числа - порядок, в котором лифт будет делать остановки. Если некоторые этажи будут одинаковые,
 считается, что пассажиры выходят из лифта одновременно — но одинаковые номера этажей требуется выводить столько же раз, сколько их встретилось во входных данных.
*/
#include <stdio.h>
int main(void){
int n1=0, n2=0, n3=0;
scanf("%d%d%d", &n1, &n2, &n3);
if (n1 >= n2){
    if (n1 >= n3){
        printf("%d", n1);
    }
}

    return 0;
}