/*
Конвертер прав доступа UNIX

В UNIX-подобных операционных системах права доступа к файлам определяются с помощью системы флагов:

r -- (read) право на чтение файла
w -- (write) право на запись в файл
x -- (execute) право на выполнение файла




Например, строка rwx обозначает, что у нас есть все права: и на чтение, и на запись и на выполнение.

Чтобы указать, что какое-то право отсутствует используют флаг -. Например, строка r-- означает, что у нас есть право на чтение, но отсутствуют права на запись и на выполнение.

Порядок в котором задаются права всегда одинаков: сначала права на чтение, потом на запись, потом на исполнение, т.е. строка wrx недопустима.



Кроме символьного представления в виде строки из трёх символов, есть ещё и числовое представление. Оно вычисляется как сумма соответствующих чисел:

r = 4
w = 2
x = 1
- = 0




Например, для строки rwx числовое представление получается как сумма 4 + 2 + 1 = 7.

А для строки r-x числовое представление будет равно 4 + 0 + 1 = 5
Задача

Напишите программу, которая переводит символьное представления прав в числовое. При этом, если на вход подаются некорректные данные, то программа должна выводить строку Invalid format.

Входные данные:

Три произвольных символа.

Выходные данные:

    Если символы корректные, т.е. могут задавать символьное представление прав доступа к файлу, то вывести соответствующее им числовое представление прав доступа к файлу.
    Если символы некорректные или подаются в неверном порядке, то вывести строку  Invalid format

*/
#include <stdio.h>
int main(void)
{
    char r, w, x;
    int sum = 0;
    scanf("%c%c%c", &r, &w, &x);
    switch (r)
    {
    case ('r'):
        sum = sum + 4;

        switch (w)
        {
        case ('w'):
            sum = sum + 2;

            switch (x)
            {
            case ('x'):
                sum = sum + 1;
                break;
            case ('-'):
                break;

            default:
                printf("Invalid format\n");
                return 0;
            }
            break;
        case ('-'):
            switch (x)
            {
            case ('x'):
                sum = sum + 1;
                break;
            case ('-'):
                break;

            default:
                printf("Invalid format\n");
                return 0;
            }
            break;

        default:
            printf("Invalid format\n");
            return 0;
        }
        break;

    case ('-'):
        switch (w)
        {

        case ('w'):
            sum = sum + 2;
            switch (x)
            {

            case ('x'):
                sum = sum + 1;
                break;
            case ('-'):
                break;
            default:
                printf("Invalid format\n");
                return 0;
            }
            break;
        case ('-'):
            switch (x)
            {

            case ('x'):
                sum = sum + 1;
                break;
            case ('-'):
                break;
            default:
                printf("Invalid format\n");

                return 0;
            }
            break;
        default:
            printf("Invalid format\n");

            return 0;
        }
        break;
    default:
        printf("Invalid format\n");

        return 0;
    }
    printf("%d\n", sum);
    return 0;
}