/*
Номер дня

Вычислить номер дня в невисокосном году по заданным числу и месяцу.

Входные данные:
Два целых числа. Первое число m -- номер месяца. 1≤m≤12
Второе число d -- номер дня в месяце. 1≤d≤31

Выходные данные:
Одно целое число -- порядковый номер дня в невисокосном году.



Намёк: Подумайте, как в этой задаче можно применить "проваливание".
*/
#include <stdio.h>
int main(void)
{
    int m, d;
    scanf("%d%d", &m, &d);
    switch (m)
    {
    case (12):
        d = 30 + d;
    case (11):
        d = 31 + d;
    case (10):
        d = 30 + d;
    case (9):
        d = 31 + d;
    case (8):
        d = 31 + d;
    case (7):
        d = 30 + d;
    case (6):
        d = 31 + d;
    case (5):
        d = 30 + d;
    case (4):
        d = 31 + d;
    case (3):
        d = 28 + d;
    case (2):
        d = 31 + d;
    case (1):
        d = d;
        printf("%d\n", d);
        break;
    default:
        break;
    }
    return 0;
}