/*Калькулятор v.0.1

Напишите программу-калькулятор для четырёх основных арифметических действий:

+ сложение
- вычитание
* умножение
/ деление

Входные данные:
Символ действия c и два целых числа a, b.

Гарантируется, что число b не будет равно нулю.

Выходные данные:
Одно вещественное число -- результат, либо строка ERROR!, если введено неверное арифметическое действие.

Формат вывода чисел: два знака после запятой.*/
#include <stdio.h>
int main(void)
{
    double a, b;
    char c;
    scanf("%c%lf%lf", &c, &a, &b);
    switch (c)
    {
    case '+':
        printf("%.2f\n", a + b);
        break;
    case '-':
        printf("%.2f\n", a - b);
        break;
    case '*':
        printf("%.2f\n", a * b);
        break;
    case '/':
        printf("%.2f\n", a / b);
        break;
    default:
        printf("ERROR!");
        break;
    }
    return 0;
}