/*
Умное освещение офиса

В трёхэтажном офисном здании установили систему освещения, позволяющую экономить электрическую энергию.

Устройство системы освещения

На каждом из трёх этажей установлены датчики движения: s1, s2 и s3.  Датчик движения подаёт сигнал 1, если на этаже есть люди, или 0 -- если этаж пустой.

Внизу, на посту охраны, есть мастер-выключатель m. Исходное состояние мастер-выключателя 0, но дежурный охранник может принудительно включить (1) или выключить (−1) всё освещение в здании, невзирая на показания датчиков.

Система должна работать по следующему принципу:

Освещение на этаже должно гореть, только если на этаже есть люди или если охранник принудительно включил всё освещение. При этом, даже если люди находятся на этаже, но охранник принудительно выключил освещение, то освещение гореть не должно.

Напишите программу для управления системой освещения.

Входные данные:

Четыре числа:

    первые три числа -- значения, полученные с датчиков s1, s2 и s3
    четвёртое число -- состояние мастер-выключателя m

Выходные данные:

Три числа -- состояние освещения на первом, втором и третьем этажах.

    1 -- если освещение на этаже включено
    0 -- если освещение на этаже выключено

Примеры:

На вход поступили значения:
1 0 1 0

Это означает:
d1 = 1 (на первом этаже есть люди)
d2 = 0 (на втором этаже нет людей)
d3 = 1 (на третьем этаже есть люди)
m = 0 (мастер-выключатель находится в нейтральном положении)

Тогда на выходе мы будем иметь:
1 0 1
освещение работает только на 1 и 3 этажах.


На вход поступили значения
0 0 1 1

Это означает:
d1 = 0 (на первом этаже нет людей)
d2 = 0 (на втором этаже нет людей)
d3 = 1 (на третьем этаже есть люди)
m = 1 (мастер-выключатель находится в положении 1, охранник принудительно включил свет)

Тогда на выходе мы будем иметь:
1 1 1
освещение работает только на 1, 2 и 3 этажах.






Наставление:

Попробуйте решить эту задачу без использования инструкции switch, только с помощью логических выражений.
*/
#include <stdio.h>

int main(void)
{
    int s1, s2, s3, m;
    scanf("%d%d%d%d", &s1, &s2, &s3, &m);

    int d1 = ((s1 + m) > 0) && (m > -1);
    int d2 = ((s2 + m) > 0) && (m > -1);
    int d3 = ((s3 + m) > 0) && (m > -1);

    printf("%d %d %d\n", d1, d2, d3);

    return 0;
}