/*
Квадранты

На координатной плоскости Oxy​ задана точка P(x,y). Необходимо указать квадрант, в котором она расположена. Номера квадрантов представлены на рисунке ниже.

Попробуйте решить задачу, используя только арифметику и операции отношения.

Входные данные:
Два вещественных числа x, y, которые не равны нулю.

Выходные данные:
Одно целое число -- номер квадранта.

 

Наставление: постарайтесь обойтись без инструкции switch
*/
#include <stdio.h>
int main(void)
{

double x, y;
scanf("%lf%lf", &x, &y);





    return 0;
}