/*
Квадранты

На координатной плоскости Oxy​ задана точка P(x,y). Необходимо указать квадрант, в котором она расположена. Номера квадрантов представлены на рисунке ниже.

Попробуйте решить задачу, используя только арифметику и операции отношения.

Входные данные:
Два вещественных числа x, y, которые не равны нулю.

Выходные данные:
Одно целое число -- номер квадранта.



Наставление: постарайтесь обойтись без инструкции switch
*/
#include <stdio.h>
int main(void)
{

    double x, y;
    int kv1, kv2, kv3, kv4, kv;
    scanf("%lf%lf", &x, &y);

    kv1 = x > 0 && y > 0;
    kv2 = (x < 0 && y > 0) * 2;
    kv3 = (x < 0 && y < 0) * 3;
    kv4 = (x > 0 && y < 0) * 4;
    kv = kv1 + kv2 + kv3 + kv4;

    printf("%d\n", kv);

    return 0;
}