/*
Сравнение вещественных чисел

Напишите программу, которая сравнивает два вещественных числа x,y с указанной точностью A.

Входные данные:

Три вещественных числа:

    x -- первое число для сравнения;
    y -- второе число для сравнения;
    A -- точность сравнения (допустимая погрешность).

Выходные данные:

    число 1, если числа приблизительно равны при данной точности сравнения;
    число 0 в противном случае.
*/
#include <stdio.h>
int main(void)
{

    double a, x, y;
    scanf("%lf%lf%lf", &x, &y, &a);
    double res = fabs(x - y);
    printf("%d\n", res < a);

    return 0;
}