/*
Модуль числа

Гилл Байтс, воодушевлённый уроком про отношения и логические операторы, решил написать программу для вычисления модуля целого числа без использования встроенных математических функций языка Си.

Для этого он решил использовать тот факт, что значение логического выражения можно сохранять в переменные и использовать при вычислениях.

Программу он написал, она компилировалась и запускалась без ошибок. Гилл проверил, что любое отрицательное число его программа переводила в правильное положительное число. Обрадовавшись, что всё работает, он пошёл на улицу играть с друзьями.

Конечно, Гилл допустил ошибку при тестировании программы. Он проверил работу программы лишь на одном сценарии из трёх возможных:

    отрицательное число;
    положительное число;
    число 0.



Исправьте программу Гилла, чтобы она работала корректно для любого целого числа.

Входные данные:

    одно целое число x

Выходные данные:

    одно целое положительное число ∣x∣ -- значение модуля от числа x



Наставление: не используйте инструкцию switch
*/
#include <stdio.h>
int main(void)
{
    int x, abs_x1, abs_x2, abs_x3, abs_x;
    scanf("%d", &x);

    abs_x1 = x * (x < 0) * -1;
    abs_x2 = x * (x == 0);
    abs_x3 = x * (x > 0);
    abs_x = abs_x1 + abs_x2 + abs_x3;

    printf("%d\n", abs_x);

    return 0;
}
