/*
Снежный прямоугольник

На вход программе подаётся два натуральных числа N и M. Напишите программу, которая выводит на экран N строк в каждой из которых по M символов *.

Входные данные:

Два натуральных числа N и M.

Выходные данные:

Прямоугольник из символов * размером N на M.

    N -- количество строк;
    M -- количество столбцов.

Подсказка: Используйте вложенные циклы for. Если на прошлом шаге вы решили копипастом, то теперь сделайте это через цикл for.
*/
#include <stdio.h>
int main(void)
{
    int n = 0;
    int m = 0;
    scanf("%d%d", &n, &m);
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            printf("*");
        }
        printf("\n");
    }
    return 0;
}
