/*
Снежинки-2

На вход программе подаётся натуральное число M. Напишите программу, которая выводит на экран 3 строки в каждой из которых по M символов *.

Входные данные:

Одно натуральное число M.

Выходные данные:

Три строки по M символов *, записанных подряд без пробелов.
*/
#include <stdio.h>
int main(void)
{
    int n = 3;
    int m = 0;
    scanf("%d", &m);
    for (int i = 0; i < n; i++){
    for (int j = 0; j < m; j++)
    {
        printf("*");
    }
    printf("\n");
}
    return 0;
}