/*
Поле битвы

Напишите программу, которая выводит на экран начальное состояние поля для битвы.

Входные данные:

Шесть натуральных чисел:

    первые два числа размеры поля: H -- высота (кол-во строк) и W -- ширина (кол-во столбцов);
    два числа x1,y1​ -- координаты поля Героя;
    два числа x2,y2​ -- координаты поля Противника.

Дополнительные пояснения:

    Начало координат -- левый верхний угол.
    Нумерация координат начинается с нуля.
    Координата x отсчитывается по горизонтали, т.е. обозначает номер столбца.

Выходные данные:

Поле битвы, где незанятые клетки обозначены символом ., клетка с героем обозначена символом H, а клетка с противником обозначается символом E.
*/
#include <stdio.h>
int main(void)
{
    int h = 0, w = 0;
    int x1 = 0, y1 = 0;
    int x2 = 0, y2 = 0;
    scanf("%d%d", &h, &w);
    scanf("%d%d", &x1, &y1);
    scanf("%d%d", &x2, &y2);
    for (int i = 0; i < h; i++)
    {
        for (int j = 0; j < w; j++)
        {
            if (j == x1 && i == y1)
            {
                printf("H");
            }
            else if (j == x2 && i == y2)
            {
                printf("E");
            }
            else
            {
                printf(".");
            }
        }
        printf("\n");
    }

    return 0;
}