/*
Горизонтальная диаграмма

На вход программы подаётся число N. А затем N целых чисел P1,P2,…,PN​.

Необходимо вывести на экран N строк, заполненных символом *.

Входные данные:

    Первая строка -- одно натуральное число N.
    Вторая строка -- N неотрицательных целых чисел P1,P2,…,PN​ (Pi≥ 0).

Выходные данные:

N строк, состоящих из символов *. В i-строке выводим Pi​ звёздочек.
*/
#include <stdio.h>
int main(void)
{
    int n = 0;
    int m = 0;
    scanf("%d", &n);
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &m);
        for (int j = 0; j < m; j++)
        {
            printf("*");
        }
        printf("\n");
    }
    return 0;
}
