/*
Читаем числа

На вход программы поступает 7 чисел. 

Программа должна в цикле for считать эти числа и вывести эти же числа, умноженные сами на себя.

Входные данные:

7 целых чисел, записанных через пробел.

Выходные данные:

7 чисел, полученные из исходных умножением на себя.

Вход: 1 2 3 4 -2 -5 6

Выход: 1 4 9 16 4 25 36
*/
#include <stdio.h>
int main(void)
{

    for (int i = 0; i < 7 ; i++){
        int tmp = 0;
        scanf("%d", &tmp);
        printf("%d ", tmp * tmp);

    }
printf("\n");
    return 0;
}