/*
Значение функции

Вывести таблицу значений функции x^3 на промежутке от −3 до 3 с шагом 0.5.

Входные данные:

Отсутствуют.

Выходные данные:

См. пример выходных данных.

Формат для первого числа: %5.2f  для второго  %8.3f

 

Указание: В качестве параметра цикла for используйте вещественную переменную x. После каждой итерации увеличивайте её значение на 0.5.
*/
#include <stdio.h>
int main(void){
    for(double i = -3.0; i <= 3.0; i = i + 0.5){
        printf("%5.2f | %8.3f\n", i, i * i * i);
    }
    return 0;
}