/*
Снегопад

Измените программу, написанную на прошлом шаге, так, что если X = номер_строки + номер_столбца чётное, то выводим символ *, если нечётное, то выводим -.

Предполагаем, что нумерация столбцов и строк начинается с единицы.

Указание: Используйте конструкция if-else во внутреннем цикле.
*/
#include <stdio.h>
int main(void)
{
    int n = 0;
    int m = 0;
    int x = 0;
    scanf("%d%d", &n, &m);
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            x = i + j;
            if(x % 2 == 0){
                printf("*");
            }
            else{
               printf("-"); 
            }
            
        }
        printf("\n");
    }
    return 0;
}
