/*
Числа Фибоначчи

Последовательность чисел Фибоначчи — это такая последовательность, где каждое следующее число получается сложением двух предыдущих.

Вот как она строится:

    Первое число: F1=1
    Второе число: F2=1F
    Третье число: F3=F2+F1=1+1=2
    Четвёртое число: F4=F3+F2=2+1=3
    и так далее: каждое следующее число — это сумма двух предыдущих.

Посчитайте значение N-го числа Фибоначчи.

Входные данные:
Одно натуральное число N  — номер числа в последовательности. (N≤45)

Выходные данные:
N-ое число Фибоначчи.
*/
