/*
Делители

Для заданного числа n вывести все его делители и их количество на экран.

Входные данные:
Одно натуральное число N.

Выходные данные:
Делители числа N, записанные через один пробел в порядке возрастания .
Количество делителей на отдельной строке.
*/
#include <stdio.h>
int main(void){
int n=0, percount=0;
scanf("%d", &n);
for(int i = 1; i <= n; i++){
    if(( n % i) == 0){
        if(percount > 0){
            printf(" ");
        }
        percount++;
        printf("%d", i);
    }

}
printf("\n%d\n", percount);
    return 0;
}