/*
Генеральная битва

Два полководца перед генеральной битвой распределяют свои войска по N полям сражений. У каждого из полководцев ровно 500 юнитов. 

На каждом поле выигрывает тот полководец, который выставил на него больше юнитов, чем противник. Если игроки выставили одинаковое количество юнитов, то на поле объявляется ничья. Победителем генеральной битвы считается тот, кто победил на большем количестве полей.

Напишите программу, которая:

    определяет, что никто из участников не нарушает правила игры:
        выставлено более 500 юнитов;
        выставлено отрицательное число юнитов (хотя бы на одном из полей);
    определяет исход Генеральной битвы.

Пример:

Входные данные:
3
200 250
100 250
200 0


Количество юнитов 1 игрока: 500. Ок, правила не нарушены.
Количество юнитов 2 игрока: 500. Ок, правила не нарушены.


Первое поле: 200 < 250 -- выигрывает 2 игрок

Второе поле: 100 < 250 -- выигрывает 2 игрок

Третье поле: 200 > 0 -- выигрыает 1 игрок.

Итого: у первого игрока одна победа, у второго игрока две победы. 

В Генеральной битве победил второй игрок.

                      
                  

 

Входные данные:

    В первой строке задано натуральное число N -- количество полей, на которых проходит Генеральная битва.
    Далее следует N строк по два натуральных числа -- количество юнитов, выставленных первым и вторым игроком на соответствующем поле сражения.

Выходные данные:

Если какой-то из игроков нарушил правила, то выводится строка: 

foul play P, где P -- это номер игрока, нарушившего правила. Правила могут нарушить оба игрока, тогда таких строк будет две:

foul play 1
foul play 2

                      
                  

Если нарушений правил не зафиксировано, то выводится одно число:

    0 -- если Генеральная битва закончилась вничью;
    1 -- если в Генеральной битве победил первый игрок;
    2 -- если в Генеральной битве победил второй игрок.
    
*/