/*


Ping

В большинстве современных операционных систем есть утилита ping, которая используется для диагностики проблем с подключением к сети. 

Например, команда

    ping -с 10 stepik.org (для Linux и macOS)
    ping -n 10 stepik.org (для Windows)

отправит небольшой пакет данных серверу Степика и засечёт пинг/задержку -- т.е. время, которое прошло от отправки запроса до получения ответа от сервера. И так 10 раз подряд. После чего она выводит сводную статистику на экран. 

Как видите, и в windows и в linux в статистике указываются: минимальная задержка, максимальная задержка и средняя задержка.

Напишите программу, эмулирующую подсчёт сводной статистики для команды ping.

Входные данные:

    В первой строке записано одно натуральное число N -- количество отправленных пакетов.
    На второй строке через пробел записаны N вещественных чисел -- время пинга до сервера.

Выходные данные:

Три вещественных числа, разделённые символом /. Точность -- три знака после запятой. 

    Первое число -- минимальное значение пинга.
    Второе число -- среднее значение пинга.
    Третье число -- максимальное значение пинга.

Тестовые данные
№ Теста
Входные данные
Выходные данные
№ Теста 1  
Входные данные 4
               10 10 11 13

Выходные данные
               10.000/11.000/13.000
№ Теста 2
Входные данные 6
                46.6 46.1 47.1 46.6 46.6 46.3
Выходные данные
                46.100/46.550/47.100

*/