/*
Усовершенствовать программу, написанную на прошлом шаге: дополнительно на отдельной строке вывести количество напечатанных чисел.

Входные данные:
Два целых числа K и M (M>K).

Выходные данные:
Натуральные числа в порядке возрастания, принадлежащие промежутку [K,M]. Числа должны быть разделены одним пробелом.
На новой строке вывести количество выведенных натуральных чисел. Если в промежутке [K,M] нет натуральных чисел, выведите нуль.
*/
#include <stdio.h>
int main(void){
int k=0, m=0, count=0;
scanf("%d%d", &k, &m);
for(k; k < m +1; k++){
    if (k > 0){
        count++;
    printf("%d ", k);}
}
printf("\n%d\n", count);

    return 0;
}