/*
Индикатор выполнения задачи

Частенько, когда предполагается, что программа будет долго выполнять какое-то действие (например: загрузка файла по сети, копирование файлов или рендеринг видео), программисты добавляют в неё progress bar (индикатор выполнения), который показывает какая часть задачи уже выполнена. 

Напишите программу, симулирующую работу прогресс-бара.

Входные данные:

Одно целое число P от 0 до 100. P -- текущий процент выполнения задачи. 

Выходные данные:

Строка, состоящая из двух частей:

    Первая часть. Пять знакомест, которые зарезервированы под вывод текущего процента выполнения задачи: число (3), символ процента (1) и пробел (1). В скобках указано количество зарезервированных знакомест.
    Вторая часть: 52 символа, которые зарезервированы под вывод текущего состояние прогресс бара: квадратные скобки (2), символы прогресс-бара (50). Каждый символ # соответствует 2% выполнения задачи. Символ : соответствует 1% выполнения задачи. 

Важно!

Из-за ограниченной ширины экрана примеры могут отображаться с переходом на другую строку, но на самом деле вывод в одну строку, без перехода на другую строку.

Примеры:

P = 10
 10% [#####.............................................]

P = 15
 15% [#######:..........................................]

P = 97
 97% [################################################:.]

P = 98
 98% [#################################################.]

P = 100
100% [##################################################]
*/
#include <stdio.h>
int main(void){
int p=0;
scanf("%d", &p);
printf("%3d%% [", p);
int a = 0, b = 0, c = 0;
a = p / 2;
b = p % 2;
c = 50 - a - b;
for(int i = 0; i < a; i++){
    printf("#");
}
for(int i = 0; i < b; i++){
    printf(":");
}
for(int i = 0; i < c; i++){
    printf(".");
}
printf("]\n");
    return 0;
}