/*
Контроль целостности данных

Автономный зонд передаёт в программу данные о своём местоположении x,y,z Из-за больших расстояний и помех данные могут искажаться, поэтому в дополнение к ним четвёртым параметром зонд передаёт контрольную сумму zond_checksum, а пятым параметром -- бит чётности zond_parity_bit.

Контрольная сумма вычисляется зондом по формуле: zond_checksum = 7*x + 11*y + 14*z

Бит чётности равен 1, если сумма x + y + z + zond_checksum нечётная, иначе 0.

Допустим, зонд находится в точке с координатами (1; 2; 2).

Тогда x = 1, y = 2, z = 2.
zond_checksum= 7*1 + 11*2 + 14*2 = 57.
total_sum = 1 + 2 + 2 + 57 = 62. Число чётное, следовательно zond_parity_bit = 0.

Значит зонд отправляет строку данных: 1 2 2 57 0






Входные данные:
На вход программы поступают пять целых чисел:

    x, y, z — координаты;
    checksum — контрольная сумма для первых трёх чисел
    parity_bit — бит чётности для первых четырёх чисел (0 -- чётная сумма, 1 -- нечётная сумма)

Проверьте целостность полученных данных. Для этого, используя полученные координаты, повторите вычисления, проделанные зондом. Затем сравните ваши значения со значениями checksum и parity_bit, поступившими на вход программы.

Выходные данные:

Строка, зависящая от того, какие проверки пройдены:

    DATA_CORRUPTED — если нарушены обе проверки (и контрольная сумма, и чётность)

    CHECKSUM_ERROR — если нарушена только контрольная сумма

    PARITY_ERROR — если нарушена только чётность

    TRANSMISSION_OK — если все проверки пройдены

*/
#include <stdio.h>
int main(void)
{
    int x = 0, y = 0, z = 0;
    int checksum = 0;
    int parity_bit = 0;

    scanf("%d%d%d%d%d", &x, &y, &z, &checksum, &parity_bit);

    int zond_checksum = 7 * x + 11 * y + 14 * z;
    int total_sum = x + y + z + zond_checksum;

    if ((checksum != zond_checksum) && (parity_bit != (total_sum % 2)))
    {
        printf("DATA_CORRUPTED\n");
        return 0;
    }
    if (checksum != zond_checksum)
    {
        printf("CHECKSUM_ERROR\n");
        return 0;
    }
    if (parity_bit != (total_sum % 2))
    {
        printf("PARITY_ERROR\n");
        return 0;
    }

    printf("TRANSMISSION_OK\n");
    return 0;
}