/*
Радар

Даны две точки: А(х1,у1)​) и В(х2,у2). Составить программу, определяющую, которая из точек находится ближе к началу координат.

Входные данные:
Четыре целых числа. Первые два числа -- координаты точки A(первая точка), следующие два числа -- координаты точки B(вторая точка).

Выходные данные:
Вывести одно целое число -- номер точки, которая находится ближе к началу координат. Если расстояния между точками до начала координат равны, то вывести 0.
*/
#include <stdio.h>
int main(void)
{
    int x1 = 0, x2 = 0, y1 = 0, y2 = 0;
    scanf("%d%d%d%d", &x1, &y1, &x2, &y2);
    int s1 = x1 * x1 + y1 * y1;
    int s2 = x2 * x2 + y2 * y2;
    if (s1 > s2)
    {
        printf("2\n");
    }
    if (s2 > s1)
    {
        printf("1\n");
    }
    if (s1 == s2)
    {
        printf("0\n");
    }

    return 0;
}