/*
Лифт

Написать программу, моделирующую работу лифта, находящегося на первом этаже.

Каждый заходящий в кабину лифта человек нажимает кнопку с номером этажа.
 После этого лифт определяет наиболее быстрый порядок транспортирования пассажиров, расставляя соответствующим образом этажи, на которых он должен остановиться.

Входные данные:
Три целых числа от 2 до 40 — номера этажей, на которые необходимо подняться пассажирам лифта.

Выходные данные:
Три числа - порядок, в котором лифт будет делать остановки. Если некоторые этажи будут одинаковые,
 считается, что пассажиры выходят из лифта одновременно — но одинаковые номера этажей требуется выводить столько же раз, сколько их встретилось во входных данных.
*/
#include <stdio.h>
int main(void)
{
    int n1 = 0, n2 = 0, n3 = 0;
    int t1 = 0, t2 = 0, t3 = 0;
    scanf("%d%d%d", &n1, &n2, &n3);
    if ((n1 >= n2))
    {
        t1 = n1;
    }
    else
    {
        t1 = n2;
    }
    if ((t1 <= n3))
    {
        t1 = n3;
    }
    if ((n1 <= n2))
    {
        t3 = n1;
    }
    else
    {
        t3 = n2;
    }
    if ((t3 >= n3))
    {
        t3 = n3;
    }
    t2 = n1 + n2 + n3 - t1 - t3;
    printf("%d %d %d\n", t3, t2, t1);
    return 0;
}
