/*
Тарифы

Услуги телефонной сети оплачиваются по следующему правилу:

    если абонент не пользовался услугами связи, то плата составляет -- 100 руб.;
    за разговоры до 500 минут (включительно) в месяц — 350 руб.;
    разговоры сверх установленной нормы в 500 минут оплачиваются из расчета 2 руб. за минуту.

Написать программу, вычисляющую плату за пользование телефоном для введенного времени разговоров за месяц.

Входные данные:
Одно целое число -- количество минут разговора за прошедший месяц.

Выходные данные:
Одно целое число -- размер платы в рублях за прошедший месяц.
*/
#include <stdio.h>
int main(void)
{
    int summ = 0;
    scanf("%d", &summ);
    if (summ == 0)
    {
        printf("%d\n", 100);
        return 0;
    }
    if (summ <= 500)
    {
        printf("%d\n", 350);
        return 0;
    }
    if (summ > 500)
    {
        printf("%d\n", 350 + (summ - 500) * 2);
        return 0;
    }

    return 0;
}