/*
Система расчёт урона в RPG-игре

Напишите программу для расчёта итогового урона, который один персонаж наносит другому в бою. Программа должна учитывать следующие факторы:

    base_damage -- базовый урон атакующего;
    defender_health -- текущий уровень жизни защитника;
    armor_class -- класс брони защитника;
    is_critical -- флаг критического удара.

Правила расчёта урона:

    Обычный удар наносит только базовый урон.
    Критический удар увеличивает итоговый урон вдвое.
    Если класс брони положительный, то итоговый урон уменьшается на armor_class / 10  (уменьшается на armor_class * 10%).

Входные данные:

Четыре числа:

    base_damage -- целое число, от 1 до 300 включительно
    defender_health -- вещественное число от 1 до 1000 включительно
    armor_class -- целое число от 0 до 8 включительно
    is_critical -- 0 или 1

Выходные данные:

    Одно вещественное число -- итоговый урон, нанесённый защитнику. Точность: 2 знака.
    Если итоговый урон больше текущего уровня жизни защитника, то защитник погибает. В этом случае с новой строки необходимо вывести фразу You win!

Пример рассчёта урона:

Входные данные: 200 1000 2 1

base_damage = 200
defender_health = 1000.0
armor_class = 2
is_critical = 1 (удар критический)

Т.е. удар критический, то урон от него увеличивается вдвое: с 200 до 400.

Класс брони защитника положительный, значит урон будет меньше на 2/10, получаем:

400 - 400*2/10 = 400 - 80 = 320.

Итоговый урон: 320

320 < 1000 -- защитник не погибает
*/
#include <stdio.h>
int main(void)
{
    int base_damage = 0;
    double defender_health = 0.0;
    int armor_class = 0;
    int is_critical = 0;
    double final_damage = 0.0;

    scanf("%d%lf%d%d", &base_damage, &defender_health, &armor_class, &is_critical);
    final_damage = base_damage * (is_critical + 1.0) - base_damage * (is_critical + 1.0) * (armor_class / 10.0);
    printf("%.2f\n", final_damage);
    if (defender_health < final_damage)
    {
        printf("You win!\n");
    }

    return 0;
}