/*
Пожарный датчик

Напишите программу, моделирующую работу пожарного датчика в комнате. Программа должна выводит сообщение Fire situation, если температура в комнате превысила 60 градусов по Цельсию.

Входные данные:
Одно целое число T -- температура в комнате.

Выходные данные:
Строка Fire situation, если T>60. В противном случае ничего выводить не нужно.
*/
#include <stdio.h>
int main(void)
{
    int t = 0;
    scanf("%d", &t);
    if (t > 60)
    {
        printf("Fire situation\n");
    }
    return 0;
}
