/*
Положительные числа

Даны три числа. Посчитать количество положительных среди этих чисел.

Входные данные:
Три целых числа a,b,c.

Выходные данные:
Одно целое число -- количество положительных чисел, среди чисел a,b,c.

Указание: здесь не нужны вложенные инструкции if-else
*/
#include <stdio.h>
int main(void)
{
    int a = 0;
    int b = 0;
    int c = 0;
    int chek = 0;
    int count = 0;

    chek = scanf("%d%d%d", &a, &b, &c);
    if (chek < 3)
    {
        return 1;
    }
    if (a > 0)
    {
        count += 1;
    }
    if (b > 0)
    {
        count += 1;
    }
    if (c > 0)
    {
        count += 1;
    }
    printf("%d\n", count);

    return 0;
}